In [1]:
%load_ext sql

C:\Users\dbsxo\Anaconda3\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
C:\Users\dbsxo\Anaconda3\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [2]:
%sql sqlite:///sample1.db

'Connected: None@sample1.db'

In [3]:
%sql select * from sqlite_master where type='table'

Done.

[('table', 'dept', 'dept', 2, 'CREATE TABLE dept (\n        deptno int not null,\n        deptname char(10),\n        floor int,\n        primary key (deptno)\n        )'),
 ('table', 'emp', 'emp', 4, "CREATE TABLE emp (\n        empno int not null,\n        empname char(10) unique,\n        title char(10) default '사원',\n        manager int,\n       ... (67 characters truncated) ... imary key(empno),\n        foreign key(manager) references emp(empno),\n        foreign key(dno) references dept(deptno) on update cascade\n        )")]

In [4]:
%sql select * from dept;

Done.

[(1, '영업', 8), (2, '기획', 10), (3, '개발', 9), (4, '총부', 7)]

In [5]:
%sql select * from emp;

Done.

[(4377, '이성래', '사장', None, 5000000, 2),
 (3426, '박영권', '과장', 4377, 3000000, 1),
 (3011, '이수민', '부장', 4377, 4000000, 3),
 (3427, '최종철', '사원', 3011, 1500000, 3),
 (1003, '조민희', '과장', 4377, 3000000, 2),
 (2106, '김창섭', '대리', 1003, 2500000, 2),
 (1365, '김상원', '사원', 3426, 1500000, 1)]

In [6]:
%%sql
select * from dept, emp
where dept.deptno = emp.dno;

Done.

[(2, '기획', 10, 4377, '이성래', '사장', None, 5000000, 2),
 (1, '영업', 8, 3426, '박영권', '과장', 4377, 3000000, 1),
 (3, '개발', 9, 3011, '이수민', '부장', 4377, 4000000, 3),
 (3, '개발', 9, 3427, '최종철', '사원', 3011, 1500000, 3),
 (2, '기획', 10, 1003, '조민희', '과장', 4377, 3000000, 2),
 (2, '기획', 10, 2106, '김창섭', '대리', 1003, 2500000, 2),
 (1, '영업', 8, 1365, '김상원', '사원', 3426, 1500000, 1)]

In [7]:
%sql sqlite:///sample2.db

'Connected: None@sample2.db'

In [8]:
%sql select * from sqlite_master where type='table'

Done.

[('table', 'student', 'student', 2, "CREATE TABLE student (\n        sid smallint constraint const_student_pk PRIMARY KEY,\n        sname char(20) NULL,\n        major varchar(30) NULL,\ ... (62 characters truncated) ... gr check ( gradelevel in ('GR', 'SO', 'GR', 'SN', 'JR', 'FR')),\n        Age smallint NULL\n        constraint const_student_age check ( age > 0 )\n)"),
 ('table', 'class', 'class', 4, 'CREATE TABLE class (\n        cname char(5),\n        time varchar(7),\n        room char(5),\n        constraint const_class_pk primary key (cname)\n        )'),
 ('table', 'enrollment', 'enrollment', 6, 'CREATE TABLE enrollment (\n        studentnumber smallint,\n        classname char(5),\n        positionnumber smallint,\n        constraint const_en ... (85 characters truncated) ... num foreign key (studentnumber) references student(sid),\n        constraint const_enroll_fk_cname foreign key (classname) references class(cname)\n)')]

In [9]:
%sql select * from student;

Done.

[(100, 'JONES', 'HISTORY', 'GR', 21),
 (150, 'PARKS', 'ACCOUNTING', 'SO', 19),
 (200, 'BAKER', 'MATH', 'GR', 50),
 (250, 'GLASS', 'HISTORY', 'SN', 50),
 (300, 'BAKER', 'ACCOUNTING', 'SN', 41),
 (350, 'RUSSEL', 'MATH', 'JR', 20),
 (400, 'RYE', 'ACCOUNTING', 'FR', 18),
 (450, 'JONES', 'HISTORY', 'SN', 24)]

In [10]:
%sql select * from class;

Done.

[('BA200', 'M-F9', 'SC110'),
 ('BD445', 'MWF3', 'SC213'),
 ('BF410', 'MWF8', 'SC213'),
 ('CS150', 'MWF3', 'EA304'),
 ('CS250', 'MWF12', 'EB210')]

In [11]:
%sql select * from enrollment;

Done.

[(100, 'BD445', 1),
 (150, 'BA200', 1),
 (200, 'BD445', 2),
 (200, 'CS250', 1),
 (300, 'CS150', 1),
 (400, 'BA200', 2),
 (400, 'BF410', 1),
 (400, 'CS250', 2),
 (450, 'BA200', 3)]

In [12]:
%sql sqlite:///sample3.db

'Connected: None@sample3.db'

In [13]:
%sql select * from sqlite_master where type='table'

Done.

[('table', 's', 's', 2, 'CREATE TABLE s (\n        sno char(5) NOT NULL primary key,\n        sname char(10) NULL,\n        city char(10) NULL\n        )'),
 ('table', 'p', 'p', 5, 'CREATE TABLE p (\n        pno char(5) NOT NULL\n        primary key,\n        pname char(10) NULL,\n        color char(10) NULL,\n        WEIGHT SMALLINT NULL,\n        city char(10) NULL\n        )'),
 ('table', 'sp', 'sp', 7, 'CREATE TABLE sp (\n        sno char(5) NOT NULL,\n        pno char(5) NOT NULL,\n        qty SMALLINT NULL,\n        constraint PK_SP primary key (sn ... (25 characters truncated) ... int FK_SP_S foreign key (sno) references S on update cascade,\n        constraint FK_SP_P foreign key (pno) references P on delete cascade\n        )')]

In [14]:
%sql select * from s;

Done.

[('s01', 'Smith', 'London'),
 ('s02', 'jones', 'Paris'),
 ('s03', 'blakes', 'Paris'),
 ('s04', 'clark', 'London'),
 ('s05', 'adams', 'Athenes')]

In [15]:
%sql select * from p;

Done.

[('p01', 'Nut', 'red', 12, 'London'),
 ('p02', 'Bolt', 'green', 17, 'Paris'),
 ('p03', 'Screw', 'blue', 17, 'Rome'),
 ('p04', 'Screw', 'red', 14, 'London'),
 ('p05', 'cam', 'blue', 12, 'Paris'),
 ('p06', 'cog', 'red', 19, 'London')]